In [54]:
import pandas as pd
import numpy as np

In [55]:
data = {
    'first': ['John', 'Martin', 'Peter', np.nan, 'NA'],
    'last': ['Wick', 'Ebner', 'Lee', np.nan, 'Missing'],
    'email': ['johnwick@gmail.com', 'martinebner@gmail.com', None, np.nan, 'anonymous'],
    'age': ['35', '41', '33', None, 'Missing'],
}

In [56]:
df = pd.DataFrame(data)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [57]:
df

    first   last                  email   age
0    John   Wick     johnwick@gmail.com    35
1  Martin  Ebner  martinebner@gmail.com    41
2   Peter    Lee                   None    33
3     NaN    NaN                    NaN  None
4     NaN    NaN              anonymous   NaN

In [58]:
df.dropna()

    first   last                  email age
0    John   Wick     johnwick@gmail.com  35
1  Martin  Ebner  martinebner@gmail.com  41

In [59]:
df.dropna(axis='index', how='any', subset=['email'])

    first   last                  email  age
0    John   Wick     johnwick@gmail.com   35
1  Martin  Ebner  martinebner@gmail.com   41
4     NaN    NaN              anonymous  NaN

In [60]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [61]:
df['age'] = df['age'].astype(float)

In [62]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [63]:
df['age'].mean()

36.333333333333336